Tekla.Structures.AnalysisInternal.AnalysisEngine.TypeEnum
Engine type.

Tekla.Structures.AnalysisInternal.AnalysisEngine.TypeEnum.DotNet
DotNet analysis engine.

Tekla.Structures.AnalysisInternal.AnalysisEngine.TypeEnum.COM32
COM server analysis engine 32-bit.

Tekla.Structures.AnalysisInternal.AnalysisEngine.TypeEnum.COM64
COM server analysis engine 64-bit.